app/Http/Controllers/Admin/Common/Products.php

    public function dataProcessing(Request $request)
    {
        $edit_product = SM::check_this_method_access('products', 'edit') ? 1 : 0;
        $product_status_update = SM::check_this_method_access('products', 'product_status_update') ? 1 : 0;
        $delete_product = SM::check_this_method_access('products', 'delete') ? 1 : 0;
        $per = $edit_product + $delete_product;

        $columns = array(
            0 => 'id',
            1 => 'title',
        );

        $totalData = Product::count();
---
select count(*) as aggregate from `products`