app/Http/Controllers/Front/CheckoutController.php

select * from `coupons` where `status` = '1' and `discount_type` = '1' and `validity` >= '2024-10-01' limit 1
---
    public function checkout()
    {
        $data["cart"] = Cart::instance('cart')->content();
        if (count($data["cart"]) > 0) {
            if (empty(session('step'))) {
                session(['step' => '0']);
            }
            $data['shipping_methods'] = ShippingMethod::Published()->get();
            $data['payment_methods'] = Payment_method::Published()->get();
            $data["sub_total"] = Cart::instance('cart')->subTotal();
            $noraml_discount = Coupon::Published()->where('discount_type', 1)->where('validity', '>=', Carbon::now()->toDateString())->first();

select * from `shipping_methods` where `shipping_methods`.`id` = '2' limit 1
---
    public function checkout_shipping_method(Request $request)
    {
        if (session('step') == '2') {
            session(['step' => '3']);
        }
        $shipping_data = ShippingMethod::find($request->shipping_method);

select * from `products` where `products`.`id` = '91' limit 1
update `products` set `product_qty` = `product_qty` - 1, `updated_at` = '2024-10-01 11:52:29' where `id` = '91'
select * from `attribute_product` where `product_id` = '91' and `attribute_id` is null and `color_id` is null limit 1
---
                $cartPro->save();

                // Decrement product stock
                $product = Product::find($pro->id);
                $product->decrement('product_qty', $pro->qty);
                $product->update();

                // Decrement stock for product attributes (size/color)
                $attributeProduct = AttributeProduct::where('product_id', $pro->id)
                    ->where('attribute_id', $pro->options->size)
                    ->where('color_id', $pro->options->color)
                    ->first();