app/Http/Controllers/Front/ProductController.php

    function categoryType_filter_by_product(Request $request)
    {
        if ($request->ajax()) {
            $output = "";
            $type = $request->type;
            $category_id = $request->category_id;
            $subcat_id[] = $category_id;
            $subcategory_id = Category::where('parent_id', $category_id)->get();
            if (!empty($subcategory_id)) {
                foreach ($subcategory_id as $item) {
                    $subcat_id[] = $item->id;
                }
            }

            if ($type == 'specials') {
                $get_products = DB::table('products')
                    ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                    ->leftJoin('reviews', 'products.id', 'reviews.product_id')
                    ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                    ->where('products.sale_price', '>', 0)
                    ->whereIn('categoryables.category_id', $subcat_id)
                    ->groupBy('products.id')
                    ->select('products.*')
                    ->take(7)
                    ->get();
            } elseif ($type == 'best_sales') {
                $get_products = DB::table('products')
                    ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                    ->leftJoin('order_details', 'products.id', 'order_details.product_id')
                    ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                    ->whereIn('categoryables.category_id', $subcat_id)
                    ->select('products.*', DB::raw('COUNT(order_details.product_id) as count'))
                    ->groupBy('products.id')
                    ->orderBy('count', 'desc')
                    ->take(7)
                    ->get();
---
select * from `categories` where `parent_id` = '13'
select `products`.* from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` left join `reviews` on `products`.`id` = `reviews`.`product_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `products`.`sale_price` > '0' and `categoryables`.`category_id` in ('13') group by `products`.`id` limit 7
select `products`.*, COUNT(order_details.product_id) as count from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` left join `order_details` on `products`.`id` = `order_details`.`product_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `categoryables`.`category_id` in ('13') group by `products`.`id` order by `count` desc limit 7

                    ->take(7)
                    ->get();
            } else {
                $get_products = DB::table('products')
                    ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                    ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                    ->whereIn('categoryables.category_id', $subcat_id)
                    ->select('products.*')
                    ->orderBy('products.id', 'desc')
                    ->groupBy('products.id')
                    ->take(7)
                    ->get();
---
select `products`.* from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `categoryables`.`category_id` in ('1', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30') group by `products`.`id` order by `products`.`id` desc limit 7

                ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                ->leftJoin('attribute_product', 'products.id', 'attribute_product.product_id')
                ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                ->select('products.*')
                ->when($brand_filter, function ($query) use ($brand_filter) {
                    if ($brand_filter != "") {
                        return $query->whereIn('products.brand_id', $brand_filter);
                    }
                })
                ->when($category_filter, function ($query) use ($category_filter) {
                    if ($category_filter != "") {
                        return $query->whereIn('categoryables.category_id', $category_filter);
                    }
                })
                ->when($minimum_price, function ($query) use ($minimum_price, $maximum_price) {
                    if ($minimum_price != "" && $maximum_price != "") {
                        return $query->whereBetween('products.regular_price', array($minimum_price, $maximum_price));
                    }
                })
                ->when($size_filter, function ($query) use ($size_filter) {
                    if ($size_filter != "") {
                        return $query->whereIn('attribute_product.attribute_id', $size_filter);
                    }
                })
                ->when($color_filter, function ($query) use ($color_filter) {
                    if ($color_filter != "") {
                        return $query->whereIn('attribute_product.color_id', $color_filter);
                    }
                })
                ->when($orderBy, function ($query) use ($orderBy) {
                    if ($orderBy != "") {
                        return $query->orderBy('products.regular_price', $orderBy);
                    } else {
                         return $query->orderBy('products.id','desc');
                    }
                })
---
select count(*) as aggregate from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` left join `attribute_product` on `products`.`id` = `attribute_product`.`product_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `products`.`regular_price` between '150' and '2550' and `attribute_product`.`color_id` in ('9', '10') group by `products`.`id`

    public function productDetail($slug)
    {
        $data["product"] = SM::getCache('product_' . $slug, function () use ($slug) {
            return Product::with("categories", "user")
                ->where("slug", $slug)
                ->where("status", 1)
                ->first();
        });
//        if (count($data["product"]) > 0) {
        if (!empty($data["product"])) {
            $data['smAdminBarId'] = $data["product"]->id;
            $data["product"]->increment("views");
            $data["relatedProduct"] = SM::getCache('product_related_product_' . $slug, function () use ($data) {
                $product_related_per_page = SM::smGetThemeOption("product_related_per_page", 6);
                $cats = SM::get_ids_from_data($data['product']->categories);

                return DB::table("products")
                    ->select('products.*')
                    ->join("categoryables", function ($join) {
                        $join->on("categoryables.categoryable_id", "=", "products.id")
                            ->where("categoryables.categoryable_type", '=', 'App\Model\Common\Product');
                    })
                    ->whereIn("categoryables.category_id", $cats)
                    ->where("products.id", '!=', $data["product"]->id)
                    ->where("products.status", 1)
                    ->orderBy("products.id", "desc")
                    ->limit($product_related_per_page)
                    ->get();
            });
---
select * from `products` where `slug` = 'kids-watch-mg-5872' and `status` = '1' limit 1
select * from `users` where `users`.`id` in ('1')
update `products` set `views` = `views` + 1, `updated_at` = '2024-09-22 17:25:54' where `id` = '138'
select `categories`.*, `categoryables`.`categoryable_id` as `pivot_categoryable_id`, `categoryables`.`category_id` as `pivot_category_id` from `categories` inner join `categoryables` on `categories`.`id` = `categoryables`.`category_id` where `categoryables`.`categoryable_id` in ('138') and `categoryables`.`categoryable_type` = 'App\Model\Common\Product'
select `products`.* from `products` inner join `categoryables` on `categoryables`.`categoryable_id` = `products`.`id` and `categoryables`.`categoryable_type` = 'App\Model\Common\Product' where `categoryables`.`category_id` in ('5') and `products`.`id` != '138' and `products`.`status` = '1' order by `products`.`id` desc limit 6

    public function categoryByProduct($slug)
    {

        $data["brands"] = Brand::Published()->get();
        $data["colors"] = Attribute::Published()->Color()->get();
        $data["sizes"] = Attribute::Published()->Size()->get();
        $data["categories"] = Category::Published()
            ->get();
        $data["categoryInfo"] = SM::getCache('category_' . $slug, function () use ($slug) {
            return Category::with("products")
                ->where("slug", $slug)
                ->where('status', 1)
                ->first();
        });
---
select * from `categories` where `status` = '1'
select * from `categories` where `slug` = 'water-pot' and `status` = '1' limit 1

            $data["meta_key"] = $data["categoryInfo"]->meta_key;
            $data["meta_description"] = $data["categoryInfo"]->meta_description;
            $data["image"] = $data["categoryInfo"]->image != '' ? asset(SM::sm_get_the_src($data["categoryInfo"]->image, 750, 560)) : '';
            $data["category"] = Category::where('slug', $slug)->first();
---
select * from `categories` where `slug` = 'water-pot' limit 1

    public function tagByProduct($slug)
    {
        $data["tagInfo"] = SM::getCache('tag_' . $slug, function () use ($slug) {
            return Tag::with("products")
                ->where("slug", $slug)
                ->where('status', 1)
                ->first();
---
select * from `tags` where `slug` = 'double-georgette' and `status` = '1' limit 1