app/Http/Controllers/Api/BrandController.php

    public function getBrands()
    {
        try {
            $brands = Brand::orderBy('id', 'desc')->get();
---
select * from `brands` order by `id` desc

    public function brandWiseProduct(Request $request)
    {
        try {

            $brand_id = $request->brand_id;

            $brandWiseProduct = Brand::findOrFail($brand_id);
            $products = $brandWiseProduct->products()->paginate(15);
---
select * from `brands` where `brands`.`id` = '2' limit 1
select * from `products` where `products`.`brand_id` = '2' and `products`.`brand_id` is not null limit 15 offset 0
select count(*) as aggregate from `products` where `products`.`brand_id` = '2' and `products`.`brand_id` is not null