app/Http/Controllers/Api/CategoryController.php

select * from `categories` where `parent_id` = '0' order by `id` desc
---
    public function getCategory()
    {
        try {
            $categories = Category::where("parent_id", 0)
                ->orderBy("id", "desc")
                ->get();

select * from `categories` where `categories`.`id` = '11' limit 1
---
    public function categoryWiseProduct(Request $request)
    {
        try {
            $category_id = $request->category_id;

            $categoryWiseProduct = Category::findOrFail($category_id);