app/Http/Controllers/Api/CheckOutController.php

            $order->payment_status = 2;


            $order->save();
---
insert into `orders` (`user_id`, `contact_email`, `cart_json`, `coupon_code`, `sub_total`, `discount`, `tax`, `coupon_amount`, `grand_total`, `payment_method_id`, `transaction_id`, `order_note`, `order_status`, `payment_status`, `updated_at`, `created_at`) values ('82', 'anam123@gmail.com', '[{\"id\":9,\"name\":\"api test product product 333\",\"qty\":2,\"options\":{\"image\":\"https:\/\/example.com\/product1.jpg\",\"sizename\":\"M\",\"colorname\":\"red\"},\"price\":150},{\"id\":137,\"name\":\"api test product product 555\",\"qty\":2,\"options\":{\"image\":\"https:\/\/example.com\/product1.jpg\",\"sizename\":\"M\",\"colorname\":\"blue\"},\"price\":150}]', 'SALE2024', '450', '30', '50', '20', '500', '6', 'sslcommerz-670263a583f288.43168657', 'Please deliver between 9am-5pm.', '3', '2', '2024-10-06 16:17:09', '2024-10-06 16:17:09')

    public function runningOrders()
    {
        try {
            $user_id = Auth::id();

            if (empty($user_id)) {
                return response()->json(['error' => 'User ID is required.'], 400);
            }

            $runningOrders = Order::where('user_id', $user_id)
                ->where(function ($query) {
                    $query->where('order_status', 2)
                        ->orWhere('order_status', 3)
                        ->orWhere('order_status', 4);
                })
                ->with('detail')
                ->paginate(10);
---
select * from `orders` where `user_id` = '78' and (`order_status` = '2' or `order_status` = '3' or `order_status` = '4') limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = '78' and (`order_status` = '2' or `order_status` = '3' or `order_status` = '4')

    public function orderHistory()
    {
        try {
            $user_id = Auth::id();

            if (empty($user_id)) {
                return response()->json(['error' => 'User ID is required.'], 400);
            }
            $orderHistory = Order::where('user_id', $user_id)
                ->where('order_status', 1)
                ->with('detail')
                ->paginate(10);
---
select count(*) as aggregate from `orders` where `user_id` = '78' and `order_status` = '1'