app/Http/Controllers/Api/ProductController.php

    public function getPopularProducts(Request $request)
    {
        try {
            $popularProducts = Product::where('status', 1)
                ->orderBy('views', 'desc')
                ->paginate(10);
---
select * from `products` where `status` = '1' order by `views` desc limit 10 offset 80
select count(*) as aggregate from `products` where `status` = '1'

    public function getLatestProducts(Request $request)
    {
        try {
            $latestProducts = Product::where('status', 1)
                ->latest()
                ->paginate(15);
---
select * from `products` where `status` = '1' order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `status` = '1'

    public function getBestSellingProducts(Request $request)
    {
        try {
            $bestSellingProducts = DB::table('order_details')
                ->selectRaw('products.*, SUM(order_details.product_qty) as total_sold')
                ->join('products', 'products.id', '=', 'order_details.product_id')
                ->groupBy('products.id')
                ->orderBy('total_sold', 'desc')
                ->paginate(15);
---
select count(*) as aggregate from `order_details` inner join `products` on `products`.`id` = `order_details`.`product_id` group by `products`.`id`
select products.*, SUM(order_details.product_qty) as total_sold from `order_details` inner join `products` on `products`.`id` = `order_details`.`product_id` group by `products`.`id` order by `total_sold` desc limit 15 offset 0

    public function productDetails(Request $request)
    {
        try {
            $product = Product::where('id', $request->product_id)->with('categories', 'brand', 'units')->first();
            $product->append('star_rating');

            if ($product === null) {
                return response()->json([
                    'error' => 'Product not found.',
                ], 404);
            }
            // Check for null pointer references
            if ($product->views === null) {
                $product->views = 0;
            }
            $product->views = $product->views + 1;
            $product->save();
---
select * from `brands` where `brands`.`id` in ('1')
select * from `products` where `id` = '133' limit 1
select * from `units` where `units`.`id` in ('1')
update `products` set `views` = '1369', `updated_at` = '2024-10-06 11:59:58' where `id` = '133'