app/Http/Controllers/Api/ProfileController.php

    public function getProfile()
    {
        if (auth()->user() === null) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $user = auth()->user();

        if ($user === null) {
            return response()->json(['error' => 'User not found'], 404);
        }

        try {
            $orders = Order::where('user_id', $user->id)->with('detail')->get();
---
select * from `orders` where `user_id` = '78'