app/Model/Common/Product.php

    public function getStarRating()
    {
        $count = $this->reviews()->count();
        if (empty($count)) {
            return 0;
        }
        $starCountSum = $this->reviews()->sum('rating');
---
select count(*) as aggregate from `reviews` where `reviews`.`product_id` = '133' and `reviews`.`product_id` is not null