app/Http/Controllers/Api/Auth/ApiAuthController.php

select * from `users` where `email` = 'Janam' limit 1
---
    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'username' => 'required_without:email',
            'email' => 'required_without:username',
            'password' => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->messages()], 400);
        }

        try {
            if (Auth::guard('web')->attempt(['email' => $request->email, 'password' => $request->password], $request->remember)) {
                $user = User::where('email', $request->email)->first();

select * from `users` where `username` is null limit 1
---
            }

            if (Auth::guard('web')->attempt(['username' => $request->username, 'password' => $request->password], $request->remember)) {
                $user = User::where('username', $request->username)->first();