app/Http/Controllers/Api/Auth/RegisterController.php

insert into `users` (`firstname`, `lastname`, `mobile`, `email`, `password`, `status`, `updated_at`, `created_at`) values ('Mahamudul Hasan', 'Anam', '01714613653', 'anam12345678913@gmail.com', 'y$sUmmfkB25QdMkH8hQUlK4eRJGF8WYGzapu05uQlSUKX1DFIY16.3i', '2', '2024-10-14 17:35:10', '2024-10-14 17:35:10')
update `users` set `otp` = '5332', `otp_expiry` = '2024-10-14 17:40:10', `updated_at` = '2024-10-14 17:35:10' where `id` = '103'
---
    public function register(Request $request)
    {
        // Validate the incoming request data
        $validator = Validator::make($request->all(), [
            'first_name' => 'required|string|max:255',
            'last_name' => 'required|string|max:255',
            'username' => 'string|max:255',
            'mobile' => 'required|regex:/^([0-9\s\-\+\(\)]*)$/|min:11|max:11',
            'email' => 'string|email|max:255|unique:users',
            'password' => 'required|string|min:6|confirmed',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->messages()], 400);
        }

        try {
            $user = User::create([
                'firstname' => $request->first_name,
                'lastname' => $request->last_name,
                'mobile' => $request->mobile,
                'email' => $request->email,
                'password' => bcrypt($request->password),
                'status' => 2,
            ]);

            $otp = rand(1111, 9999);
            $user->otp = $otp;
            $user->otp_expiry = now()->addMinutes(5);
            $user->save();

select * from `users` where `mobile` = '01714613653' limit 1
update `users` set `otp` = '3277', `otp_expiry` = '2024-10-14 17:41:16', `updated_at` = '2024-10-14 17:36:16' where `id` = '78'
---
    public function forgotPassword(Request $request)
    {
        $this->validate($request, [
            'mobile' => 'required|regex:/^([0-9\s\-\+\(\)]*)$/|min:11|max:11',
        ]);


        $user = User::where('mobile', $request->mobile)->first();
        if (!$user) {
            return response()->json(['error' => 'User not found'], 404);
        }

        $otp = rand(1111, 9999);

        $otpExpiry = now()->addMinutes(5);

        $user->otp = $otp;
        $user->otp_expiry = $otpExpiry;
        $user->save();