app/SM/SM_Front.php

select * from `categories` where `parent_id` = '1'
select * from `categories` where `parent_id` = '15'
---
    public static function category_tree_for_select_cat_id($category_id, $segment = null)
    {
        $category_data = Category::where('parent_id', $category_id)->get();
        $html = '';
        if ($category_data) {

            $html .= '<ul class="sub-cat ">';
            foreach ($category_data as $s_category) {
                if ($segment == $s_category->slug) {
                    $selected = 'checked';
                } else {
                    $selected = '';
                }
                if (count($s_category->products) > 0) {
                    $html .= '<li>
                            <input ' . $selected . ' type="checkbox" id="c1_' . $s_category->id . '" value="' . $s_category->id . '"
                                   class="common_selector category"/>
                            <label for="c1_' . $s_category->id . '">
                                <span class="button"></span>
                                ' . $s_category->title . '<span class="count">( ' . count($s_category->products) . ' )</span>
                            </label>';
                    $category_data2 = Category::where('parent_id', $s_category->id)->get();

select * from `settings` where `option_name` = 'is_maintenance_enable' limit 1
---
    public static function get_setting_value($option_name, $default = null)
    {
        if (self::sm_string($option_name)) {
            if (isset(self::$settings_autoload[$option_name])) {
                return self::$settings_autoload[$option_name];
            } else {
                self::initSettingAutoLoad();
                if (isset(self::$settings_autoload[$option_name])) {
                    return self::$settings_autoload[$option_name];
                } else {
                    $setting = Setting::where('option_name', $option_name)->first();

select * from `settings` where `autoload` = '1'
---
    public static function initSettingAutoLoad()
    {
        $settings_autoload = Cache::rememberForever("setting_autoload", function () {
            return Setting::where('autoload', 1)->get();

select * from `users_metas` where `user_id` = '78' and `meta_key` = 'user_online_status' limit 1
---
    public static function update_front_user_meta($user_id, $meta_key, $meta_value)
    {
        $front_user_meta = Users_meta::where('user_id', $user_id)
            ->where('meta_key', $meta_key)
            ->first();

select * from `visitors` where `date` = '2024-10-01' limit 1
update `visitors` set `views` = `views` + 1 where `id` = '1858'
insert into `visitors` (`date`, `views`) values ('2024-10-01', '1')
---
    public static function sm_daily_visit()
    {
        $date = date('Y-m-d');
        if (!(Session::has('views') && session('views') == $date) || !Session::has('views')) {
            $date = date('Y-m-d');
            //      $date = '2016-06-25';
            $visitor = Visitor::where('date', $date)->first();
            if ($visitor) {
                $visitor->increment('views');
            } else {
                $visitor = new Visitor();
                $visitor->date = $date;
                $visitor->views = 1;
                $visitor->save();

select * from `categories` where `parent_id` = '0'
---
    public static function getMainCategories($isWithHaveNoProduct = 1)
    {
        if ($isWithHaveNoProduct == 1) {
            return SM::getCache('main_categories_have_not_post', function () {
                return Category::where('parent_id', 0)->get();
            });
        } else {
            return SM::getCache('main_categories_have_posts', function () {
                //                return Category::where("total_posts", ">", 0)
                //                    ->get();
                return Category::where('parent_id', 0)->get();

select `products`.*, COUNT(order_details.product_id) as count from `products` left join `order_details` on `products`.`id` = `order_details`.`product_id` where `products`.`status` = '1' group by `products`.`id` order by `count` desc limit 6
---
    public static function getBestSaleProduct($noOfProduct = 6)
    {
        $bestSale = SM::getCache('product_detail_best_sale', function () use ($noOfProduct) {
            return DB::table('products')
                ->leftJoin('order_details', 'products.id', 'order_details.product_id')
                ->select('products.*', DB::raw('COUNT(order_details.product_id) as count'))
                ->groupBy('products.id')
                ->orderBy('count', 'desc')
                ->limit($noOfProduct)
                ->where("products.status", 1)
                ->get();

select * from `wishlists` where `product_id` = '115' and `user_id` = '78' limit 1
---
    public static function quickViewHtml($product_id = null, $slug = null)
    {
        $quick_view_html = '';
        if (Auth::check()) {
            $check_wishlist = Wishlist::where('product_id', $product_id)->where('user_id', Auth::id())->first();

select * from `products` where `products`.`id` = '53' limit 1
---
    public static function addToCartButton($product_id = null, $regular_price = null, $sale_price = null, $addClass = null)
    {

        $product = Product::find($product_id);

select * from `products` where `products`.`id` = '137' limit 1
---
    public static function productDiscount($product_id = null)
    {
        $product = Product::find($product_id)->first();

select * from `categories` where `parent_id` = '1' order by `priority` asc
---
    static function categoryBySubCategories($category_id = null)
    {
        $get_subcategories = Category::where('parent_id', $category_id)
            ->orderBy('priority')
            ->get();

select * from `categories` where `parent_id` = '1'
select `products`.* from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `categoryables`.`category_id` in ('1', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30') group by `products`.`id` order by `products`.`id` desc limit 7
---
    static function categoryProducts($category_id = null)
    {
        $subcat_id[] = $category_id;
        $subcategory_id = Category::where('parent_id', $category_id)->get();
        if (!empty($subcategory_id)) {
            foreach ($subcategory_id as $item) {
                $subcat_id[] = $item->id;
            }
        }

        $get_products = DB::table('products')
            ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
            ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
            ->whereIn('categoryables.category_id', $subcat_id)
            ->select('products.*')
            ->orderBy('products.id', 'desc')
            ->groupBy('products.id')
            //            ->skip(1)
            ->take(7)
            ->get();

select * from `attribute_product` where `product_id` = '17' order by `id` asc limit 1
---
    public static function getAttributeByProductId($product_id = null)
    {
        $attribute = \App\Model\Common\AttributeProduct::where('product_id', $product_id)
            ->orderBy('id', 'ASC')
            ->first();

select `attributes`.`title`, `attribute_product`.* from `attribute_product` inner join `attributes` on `attribute_product`.`attribute_id` = `attributes`.`id` where `attribute_product`.`product_id` = '133' group by `attribute_id`
---
    static function productAttributeSize($product_id)
    {
        $get_sizes = DB::table('attribute_product')
            ->join('attributes', 'attribute_product.attribute_id', 'attributes.id')
            ->where('attribute_product.product_id', $product_id)
            ->select('attributes.title', 'attribute_product.*')
            ->groupBy('attribute_id')
            ->get();

select `attributes`.`title`, `attribute_product`.* from `attribute_product` inner join `attributes` on `attribute_product`.`color_id` = `attributes`.`id` where `attribute_product`.`product_id` = '133' group by `color_id`
---
    static function productAttributeColor($product_id)
    {
        $get_colors = DB::table('attribute_product')
            ->join('attributes', 'attribute_product.color_id', 'attributes.id')
            ->where('attribute_product.product_id', $product_id)
            ->select('attributes.title', 'attribute_product.*')
            ->groupBy('color_id')
            ->get();

select * from `categories` where `categories`.`id` = '1' limit 1
---
    static function sm_get_menu($menu)
    {
        $nav = "";
        $nav_wrapper = (isset($menu['nav_wrapper'])) ? $menu['nav_wrapper'] : 'ul';
        $start_class = (isset($menu['start_class'])) ? $menu['start_class'] : 'menu-links pull-right';
        $link_wrapper = (isset($menu['link_wrapper'])) ? $menu['link_wrapper'] : 'li';
        $home_class = (isset($menu['home_class'])) ? $menu['home_class'] : '';
        $has_dropdown_wrapper_class = (isset($menu['has_dropdown_wrapper_class'])) ? $menu['has_dropdown_wrapper_class'] : 'has-menu-items';
        $dropdown_class = (isset($menu['dropdown_class'])) ? $menu['dropdown_class'] : 'drop-down-multilevel';
        $subnavClass = (isset($menu['subNavUlClass'])) ? $menu['subNavUlClass'] : 'dropdown-menu mega_dropdown';


        $show = (isset($menu['$show']) && $menu['$show'] != '') ? $menu['$show'] : true;
        $main_menu = self::sm_unserialize(self::get_setting_value('main_menu'));

        $nav .= "<$nav_wrapper class='$start_class'>";
        $nav .= "<$link_wrapper class='index $home_class'>
                     <a href='" . url('/') . "'><i class='fa fa-home'></i> Home</a>
                  </$link_wrapper>";
        if (isset($main_menu['menu_item']) && count($main_menu['menu_item']) > 0) {
            $main_menu = $main_menu['menu_item'];
            foreach ($main_menu as $item) {
                $image = '';
                if ($item['menu_type'] == 'page') {
                } else {
                    $get_menu_type = explode('|', $item['menu_type']);
                    if ($get_menu_type[0] == 'category') {
                        $get_category = Category::find($get_menu_type[1]);